# Предсказание оттока клиентов в фитнес-центре

Целью настоящего исследования является разработка плана по удержанию клиентов сети фитнес-центров «Культурист-датасаентист». Путём анализа клиентских анкет планируется решить следующие задачи:
1. Научиться прогнозировать вероятность оттока на уровне следующего месяца для каждого клиента;
2. Сформировать типичные портреты клиентов: выделить несколько наиболее ярких групп и охарактеризовать их основные свойства;
3. Проанализировать основные признаки, наиболее сильно влияющие на отток;
4. Разработать рекомендации по повышению качества работы с клиентами:
    1. выделить целевые группы клиентов;
    2. предложить меры по снижению оттока;
    3. определить другие особенности взаимодействия с клиентами.
    
 # Общий вывод
 
 В данном исследовании мы проанализировали 4000 анкет клиентов сети фитнес-центров «Культурист-датасаентист» и выявили следующие особенности:
1. Половая принадлежность клиентов не оказывает никакого влияния на факт оттока;
2. Сильнее всего с оттоком связаны возраст клиента (чем он моложе, тем больше вероятность ухода), активность посещений в последний месяц (если человек внезапно перестал ходить, скорее всего, он уже не вернется) и длительность абонемента (контракт на 1 или 3 месяца после завершения часто не продляют).
3. На отток также влияют наличие корпоративного абонемента, участие в программе "Приведи друга", удобство расположения зала и посещение групповых занятий.

На основе данных мы создали две модели бинарной классификации для предсказания вероятности оттока клиента в следующем месяце. Протестировав их на валидационной выборке, получили такие значения метрик: 
- для модели логистической регрессии:
    - Accuracy: 0.90, 
    - Precision: 0.79, 
    - Recall: 0.82, 
    - F1: 0.81, 
    - ROC_AUC: 0.96; 
- для модели случайного леса: 
    - Accuracy: 0.90, 
    - Precision: 0.81, 
    - Recall: 0.75, 
    - F1: 0.78, 
    - ROC_AUC: 0.95. 

Доля правильных ответов (accuracy) двух моделей одинакова, поэтому в зависимости от целей можно использовать любую из них: для удержания как можно большего числа клиентов модель логистической регрессии подходит лучше (выше полнота обнаружения объектов целевого класса (recall) и сводные метрики F1-score и ROC_AUC), однако если компания опасается раздражать клиентов агрессивным маркетингом и ценит точность предсказаний, следует использовать случайный лес (точность предсказаний в целевом классе (precision) у него выше).

Мы также разбили клиентов на 5 кластеров с помощью алгоритма K-Means и получили несколько характерных групп:
1. Клиенты с высоким средним возрастом (30 с половиной лет), которые часто ходят на групповые тренировки (52%), покупают долгосрочные абонементы (средний срок - полгода) и активно приобретают дополнительные услуги (каждый клиент дополнительно приносит в среднем 179 у.е.). Они также чаще остальных ходят в зал (2,36 тренировки в текущем месяце) и лояльны сети (средний lifetime - 5,4 месяцев). 38% имеют корпоративные абонементы. Среди них самый низкий уровень оттока - всего 2%.
2. Самые молодые клиенты (средний возраст 28 лет), которые тратят мало денег на дополнительные услуги (117,18 у.е.), не очень охотно посещают групповые занятия (29%), берут краткосрочные абонементы (средний срок - 2 месяца), что соответствует их низкой лояльности сети (средний lifetime - около 2 месяцев, среднее количество тренировок в неделю - 1). В данном кластере самый низкий процент партнёрских абонементов и самый высокий уровень оттока - 56%.
3. Клиенты, которые живут и работают далеко от фитнес-центра, поэтому редко ходят на тренировки, как групповые (23%), так и индивидуальные (1,6 раз в неделю), и быстро их бросают. Средний возраст этих клиентов - 28 с половиной лет. Средняя длительность абонемента соответствует "сроку жизни" клиента - 3 месяца, величина оттока - 40%.
4. Клиенты, которые пришли по приглашению друзей, возрастом от 29 с половиной лет и старше с самыми долгими абонементами (средний срок больше полугода), 89% из которых корпоративные. Отток в данном кластере составляет 12%.
5. Клиенты, которые отказались оставлять свой контактный телефон. Средний возраст группы достаточно высокий - 29 лет, 14% живут далеко от зала, 47% имеет корпоративный абонемент, 31% пришли по акции "Приведи друга", 43% ходят на групповые тренировки, средний lifetime около 4 месяцев. Отток в данном кластере составляет 27%.

Данные по кластерам подтвердили предположение, что на отток сильно всего влияют возраст, длительность абонемента, участие в корпоративных программах или акции "Приведи друга" и удобство расположения зала. С учётом этого мы можем дать следующие рекомендации:
1. Целевая группа клиентов - люди старше 30 лет, которые живут или работают неподалёку от центра, поэтому на них нужно делать упор в рекламной кампании;
2. Более молодых клиентов можно привлекать через акцию "Приведи друга" и корпоративный фитнес, поэтому стоит расширить партнёрскую сеть среди работодателей и сделать привлекательными условия реферальной программы как для пригласившего, так и для приглашённого;
3. Данные показывают, что факт посещения групповых тренировок положительно сказывается на удержании клиента, поэтому нужно составить удобное расписание занятий и активно рекламировать клиентам этот вид услуг;
4. Также рекомендуем снизить цены долгих контрактов, чтобы мотивировать клиентов покупать абонементы сроком от полугода и выше: в долгосрочной перспективе их лояльность окупится.
